In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                    'year': [2012, 2014, 2013, 2014],
                    'sale':[55, 40, 84, 31]})
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [6]:
# 1. set_index：不会修改原始的DataFrame对象，需要将某一列作为索引的时候使用
# drop：是否删除作为索引的列
# df.set_index(["month", 'year'])
df.set_index("month", drop=False)

       month  year  sale
month
1          1  2012    55
4          4  2014    40
7          7  2013    84
10        10  2014    31

In [12]:
# 2. 重置下标索引：需要重置下标索引的时候使用，不会修改原始的DataFrame对象
# drop：代表是否删除原始索引，默认是不删除
df1 = df.copy()
df1.index = [3,4,5,6]
print(df1)
df2 = df1.reset_index(drop=True)
print(df2)

   month  year  sale
3      1  2012    55
4      4  2014    40
5      7  2013    84
6     10  2014    31
   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [16]:
# 3. reindex

# 特点1：如果新增的索引，在原始的索引中不存在，那么所有列的值将会使用NAN来代替
# df.reindex([0,1,2,3,4])

# 特点2：如果新的索引中不包含原来的某个索引，其实就相当于删掉了没被添加到新索引中的这一行数据
# df.reindex([1,2,3])

# 特点3：如果新的索引相对于原来索引顺序发生改变，那么相当于变相修改了行的顺序。
df.reindex([3,1,2,0])

   month  year  sale
3     10  2014    31
1      4  2014    40
2      7  2013    84
0      1  2012    55

In [20]:
df.index = [10,11,12, 13]
df

    month  year  sale
10      1  2012    55
11      4  2014    40
12      7  2013    84
13     10  2014    31